RSN/src/DataProcessors/UniversalMechanisms/UniversalMechanisms.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>UniversalMechanisms</name>
</mdclass:DataProcessor>

RSN/src/InformationRegisters/ПрофилиПользователей/ПрофилиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрофилиПользователей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Установлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПользовательИБ</name>
    <type>
      <types>CatalogRef.ПользователиИБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Профиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/Enums/КонфигурацииИнформационныхБаз/КонфигурацииИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонфигурацииИнформационныхБаз</name>
  <enumValues>
    <name>Бухгалтерия</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Документооборот</name>
  </enumValues>
  <enumValues>
    <name>УправлениеХолдингом</name>
  </enumValues>
  <enumValues>
    <name>БухгалтерияБИТ</name>
  </enumValues>
  <enumValues>
    <name>ГорнодобывающаяПромышленность</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Catalogs/ОбъектыМетаданныхИнформационныхБаз/ОбъектыМетаданныхИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыМетаданныхИнформационныхБаз</name>
  <owners>Catalog.ВидыМетаданных</owners>
  <attributes>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВСервисе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИменаРеквизитовТипаДата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПриЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>СерверПриложений</name>
    <type>
      <types>CatalogRef.СерверПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьНаВебСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>EnumRef.КонфигурацииИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Среда</name>
    <type>
      <types>EnumRef.Среда</types>
    </type>
  </attributes>
  <attributes>
    <name>Контур</name>
    <type>
      <types>CatalogRef.Контур</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/DataProcessors/UniversalMechanisms/Forms/РегистрацияПользователей/Module.bsl
#Область ОбработчикиСобытийФормы
   
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГрупповойОбработчик = Справочники.ОбъектыМетаданныхИнформационныхБаз.НайтиПоНаименованию("Изменить свойства пользователей ИБ");
	СформироватьПояснениеКОбработчику(ГрупповойОбработчик, Элементы.ПояснениеКОбработчику.Заголовок);
	ИмяТекПользователя = ПолучитьИмяПользователя();  
	Если ИмяТекПользователя = "Nikolay Ivanov" = Ложь Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолучателиДобавитьПрофили", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолучателиУстановитьПрофили", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолучателиПодобратьИБПоКонфигурации", "Видимость", Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкиАвторизации = ИнтеграцияКлиент.ПолучитьНастройкиАвторизации(); 
КонецПроцедуры   

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеНастроекАвторизации" Тогда		
		НастройкиАвторизации = ИнтеграцияКлиент.ПолучитьНастройкиАвторизации();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	Если Режим = 0 Тогда
		
		ПроверяемыеРеквизиты.Добавить("Логин");
		ПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);		
		
	ИначеЕсли Режим = 1 Тогда
		
		ПроверяемыеРеквизиты.Добавить("СписокПользователей.Логин");
		
		Для ТекСтрока = 0 По СписокПользователей.Количество()-1 Цикл		
			ТекПользователь = СписокПользователей.Получить(ТекСтрока);
			ПроверитьЗаполнениеРеквизитов(ТекПользователь, Отказ, ТекСтрока);					
		КонецЦикла;
		 
	ИначеЕсли Режим = 2 Тогда
		
		ПроверяемыеРеквизиты.Добавить("ГрупповойОбработчик");	
				
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИБПоКонфигурации(Команда) 
	ДопПараметры = Новый Структура;
	Если ИмяТекПользователя = "Nikolay Ivanov" Тогда 
		ДопПараметры.Вставить("БезТестовых", 	Истина);
		ДопПараметры.Вставить("Конфигурация", 	"Бухгалтерия");
	КонецЕсли;
	ОбработкаОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыПодбораИБ", ЭтотОбъект);
				
	ОткрытьФорму("Справочник.ИнформационныеБазы.Форма.ФормаПодбораИБКонфигурация",ДопПараметры,ЭтотОбъект,УникальныйИдентификатор,,,
													ОбработкаОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура РежимПриИзменении(Элемент)
	
	Если Режим = 0 Тогда
		Элементы.ГруппаОдиночныйРежим.Видимость 		 = Истина;
		Элементы.ГруппаРежимСписком.Видимость 			 = Ложь;
		Элементы.ГруппаРежимГрупповойОбработки.Видимость = Ложь;
	ИначеЕсли Режим = 1 Тогда
		Элементы.ГруппаОдиночныйРежим.Видимость 		 = Ложь;	
		Элементы.ГруппаРежимСписком.Видимость 			 = Истина;
		Элементы.ГруппаРежимГрупповойОбработки.Видимость = Ложь;
	ИначеЕсли Режим = 2 Тогда
		Элементы.ГруппаОдиночныйРежим.Видимость          = Ложь;	
		Элементы.ГруппаРежимСписком.Видимость            = Ложь;
		Элементы.ГруппаРежимГрупповойОбработки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	ЛогинПриИзмененииЭлемента(Логин, ПользовательОС);	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательОСНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		ОткрытьФорму("Справочник.Пользователи.Форма.ВыборПользователяОперационнойСистемы", , Элемент);
#КонецЕсли 

КонецПроцедуры

&НаКлиенте
Процедура ГрупповойОбработчикПриИзменении(Элемент)
	СформироватьПояснениеКОбработчику(ГрупповойОбработчик, Элементы.ПояснениеКОбработчику.Заголовок)
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПользователей 

&НаКлиенте
Процедура СписокПользователейЛогинПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокПользователей.ТекущиеДанные;
	
	ЛогинПриИзмененииЭлемента(ТекущиеДанные.Логин, ТекущиеДанные.ПользовательОС);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейПользовательОСНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		ОткрытьФорму("Справочник.Пользователи.Форма.ВыборПользователяОперационнойСистемы", , Элемент);
#КонецЕсли 
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолучатели 

&НаКлиенте
Процедура ПолучателиПрофилиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)    
	
	СтандартнаяОбработка = Ложь;   
	
	ТекущиеДанные = Элементы.Получатели.ТекущиеДанные;
		
	ИнформационныеБазы = Новый Массив;
	ИнформационныеБазы.Добавить(ТекущиеДанные.ИБ); 
		
	ОткрытьФормуЗаполненияПрофилейГруппДоступа(ИнформационныеБазы, ТекущиеДанные.Профили.ВыгрузитьЗначения(), Новый Структура("ИБ", ТекущиеДанные.ИБ)); 
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура СгенерироватьПароль(Команда)  
	Пароль = СгенерироватьПарольНаСервере();  
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИБ(Команда)   
	ДопПараметры = Новый Структура;
	Если ИмяТекПользователя = "Nikolay Ivanov" Тогда 
		ДопПараметры.Вставить("БезТестовых", 	Истина);
		ДопПараметры.Вставить("Конфигурация", 	"Бухгалтерия");
	КонецЕсли;
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыПодбораИБ", ЭтотОбъект);
				
	ОткрытьФорму("Справочник.ИнформационныеБазы.Форма.ФормаПодбораИБ",ДопПараметры,ЭтотОбъект,УникальныйИдентификатор,,,
													ОбработкаОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяПользователя()
	ТекПользователь = Пользователи.ТекущийПользователь();
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПользователь,"Наименование");
КонецФункции

&НаКлиенте
Процедура ОбновитьШапкуБаза()
	Всего 	= 0;
	Выбрано = 0;
	Для Каждого Эл Из Получатели Цикл 
		Всего = Всего + 1;
		Если Эл.Регистрировать Тогда 
			Выбрано = Выбрано + 1;
		КонецЕсли;
	КонецЦикла;
	
	ШаблонТекст = ", (%1/%2)";
	ДопТекст 	= ?(Всего = 0, "",СтрШаблон(ШаблонТекст,Формат(Выбрано,"ЧН=0; ЧГ="),Формат(Всего,"ЧН=0; ЧГ=")));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолучателиИБ_База", "Заголовок", "База" + ДопТекст);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПрофили(Команда) 
	
	ОткрытьФормуЗаполненияПрофилейГруппДоступа();
													
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПрофильПоПользователю(Команда)
	
	Если ЗначениеЗаполнено(Логин) Тогда 
		ПользовательШаблон = Логин;
	КонецЕсли;
	
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПрофильПоПользователюЗавершение", ЭтотОбъект);  
	Подсказка = НСтр("ru = 'Укажите имя пользователя'");
	ПоказатьВводСтроки(Оповещение,ПользовательШаблон,Подсказка); 
	
КонецПроцедуры

&НаКлиенте
Процедура Зарегистрировать(Команда)
	
	ОчиститьСообщения();
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Режим = 0 ИЛИ Режим = 1 Тогда
		ЗарегистрироватьНаСервере();
	ИначеЕсли Режим = 2 Тогда 
		ВыполнитьГрупповойОбработчик();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрофилиДоступаВсехИБ(Команда)
	ОткрытьФорму("Справочник.ПрофилиГруппДоступаИнформационныхБаз.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	
	Если ПустаяСтрока(Логин) Тогда 
		Возврат;
	КонецЕсли;
	
	Шаблон = ОбщегоНазначенияВызовСервера.ЗначениеДополнительнойКонстанты("ШаблонЗаполненияПользователя");
	
	Если Не ЗначениеЗаполнено(Шаблон) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(" Не заполнено значение шаблона 'ШаблонЗаполненияПользователя'");
		Возврат;
	КонецЕсли;
	
	Структура = Новый Структура("Шаблон", Шаблон);
	
	Если СтрНайти(СокрЛП(Логин), " ") Тогда 
		ПоказатьВводСтроки(Новый ОписаниеОповещения("ЗаполнитьПоШаблонуЗавершение", ЭтотОбъект, Структура), ".", "В логине есть пробел, укажите символ для замены", 1, Ложь);
        Возврат;
	КонецЕсли;
	
	ЗаполнитьПоШаблонуЗавершение(".", Структура);
КонецПроцедуры

&НаКлиенте
Процедура НовыйПользователь(Команда)
	
	ЗначенияПоУмолчанию = Новый Структура;
	ЗначенияПоУмолчанию.Вставить("Пароль", "123");
	ЗначенияПоУмолчанию.Вставить("Аутентификация1С", Истина);
	ЗначенияПоУмолчанию.Вставить("ПотребоватьСменуПароляПриВходе", Истина);
	ЗначенияПоУмолчанию.Вставить("АутентификацияОС", Истина);
	ЗначенияПоУмолчанию.Вставить("Язык", "Русский");
	
	Если Режим = 0 Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияПоУмолчанию);
	ИначеЕсли Режим = 1 Тогда
		Для Каждого Пользователь Из СписокПользователей Цикл
			ЗаполнитьЗначенияСвойств(Пользователь, ЗначенияПоУмолчанию);	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Помощник(Команда)
	Элементы.ФормаПомощник.Пометка = Не Элементы.ФормаПомощник.Пометка;
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриЗакрытииФормыПодбораИБ(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли; 	
	
	ДанныеДляЗаполнения = ПолучитьДанныеИб(Результат);
	Отбор = Новый Структура("ИБ");
	Для Каждого База Из ДанныеДляЗаполнения Цикл  
		ЗаполнитьЗначенияСвойств(Отбор, База);
		НайденнаяСтрока = Получатели.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() = 0 Тогда
			ЗаполнитьЗначенияСвойств(Получатели.Добавить(), База);			
		КонецЕсли;
	КонецЦикла;
	ОбновитьШапкуБаза();	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьДанныеИб(Массив)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформационныеБазы.ПутьНаВебСервере КАК ПутьНаВебСервере,
	               |	ИнформационныеБазы.ПутьНаВебСервере = """" = ЛОЖЬ КАК Регистрировать,
	               |	ИнформационныеБазы.Ссылка КАК ИБ,
	               |	ИнформационныеБазы.Организация КАК Организация
	               |ИЗ
	               |	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	               |ГДЕ
	               |	ИнформационныеБазы.Ссылка В(&Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", Массив);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуЗаполненияПрофилейГруппДоступа(ИнформационныеБазы = Неопределено, ТекущиеПрофили = Неопределено, ДополнительныеПараметры = Неопределено)
	
	
	Если ИнформационныеБазы = Неопределено Тогда
		
		ИнформационныеБазы = Новый Массив;  	
		Для Каждого Стр Из Получатели Цикл  	
			
			Если Не Стр.Регистрировать Тогда
				Продолжить;
			КонецЕсли;   
			
			ИнформационныеБазы.Добавить(Стр.ИБ);
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ИнформационныеБазы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны информационные базы для заполнения.'"));
		Возврат;
	КонецЕсли;

	ОбработкаОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыЗаполненияПрофилейГруппДоступа", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.ПрофилиГруппДоступаИнформационныхБаз.Форма.ФормаПодбораПрофилейГруппДоступа", 
					Новый Структура("ИнформационныеБазы, ТекущиеПрофили", ИнформационныеБазы, ТекущиеПрофили),
						ЭтотОбъект,УникальныйИдентификатор,,,ОбработкаОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
						
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПрофильПоПользователюЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если НЕ Строка = Неопределено И Не ПустаяСтрока(Строка) Тогда
		ПользовательШаблон = Строка; 
		ЗаполнитьПрофильПоПользователюНаСервере()	        
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПрофильПоПользователюНаСервере()
	
	Если НастройкиАвторизации.ИспользуетсяАутентификацияОС Тогда 
		Аутентификация = Новый Структура("Аутентификация", КоннекторHTTP.НоваяАутентификацияОС());		
	Иначе                                                    
		Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", НастройкиАвторизации.ИмяПользователя, НастройкиАвторизации.Пароль));	
	КонецЕсли;
	
	Для Каждого Стр Из Получатели Цикл
		
		Если Не Стр.Регистрировать Тогда
			Продолжить;
		КонецЕсли; 
		
		ПутьНаВебСервере = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ИБ, "ПутьНаВебСервере");	
		
		Попытка 
			Ответ = Интеграция.ОбратитьсяКВебСервису(ПутьНаВебСервере, "GET", "DataProcessings/UserAccessGroups", Аутентификация, Новый Структура("ИмяПользователя", ПользовательШаблон));
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка при получении сведений о пользователе " + ПутьНаВебСервере + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		КонецПопытки; 
		
		Если ТипЗнч(Ответ) = Тип("Структура") Тогда
			Если Ответ.Свойство("error") И Ответ.error Тогда    
				ТекстОшибки = "Ошибка при получении сведений о пользователе " + ПутьНаВебСервере + Символы.ПС + Ответ.message;
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);				
			КонецЕсли;				
		КонецЕсли; 
		
		Если Не Ответ.Количество() Тогда 
			Если Не Стр.Профили.Количество() Тогда
				Стр.Регистрировать = Ложь;	
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Стр.Профили.Очистить();
		Для каждого Профиль Из Ответ Цикл
			Стр.Профили.Добавить(Профиль,,Истина);	
		КонецЦикла;		

	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыЗаполненияПрофилейГруппДоступа(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;  
	
	ПриЗакрытииФормыЗаполненияПрофилейГруппДоступаНаСервере(Результат, ДополнительныеПараметры);
			
КонецПроцедуры  

&НаСервере
Функция ПолучитьМассивПрофилейГрупп(ИБ, МассивГрупп)
	Возврат Справочники.ГруппыПрофилей.ПолучитьМассивПрофилей(ИБ, МассивГрупп);
КонецФункции


&НаСервере
Процедура ПриЗакрытииФормыЗаполненияПрофилейГруппДоступаНаСервере(Результат, ДополнительныеПараметры)
	
	РежимГрупп = "Профили"; 
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда 
		Если ДополнительныеПараметры.Свойство("Режим") и ЗначениеЗаполнено(ДополнительныеПараметры.Режим) Тогда 
			РежимГрупп = ДополнительныеПараметры.Режим;
		КонецЕсли;
	КонецЕсли;    
	
	Если Не Результат.Получить(Перечисления.КонфигурацииИнформационныхБаз.ПустаяСсылка()) = Неопределено Тогда
		
		//заполняем по всем    
		
		ВыбранныеЗначения = Результат.Получить(Перечисления.КонфигурацииИнформационныхБаз.ПустаяСсылка());
		Для Каждого Стр Из Получатели Цикл
			
			Стр.Профили.Очистить(); 
			Если РежимГрупп = "Группы" Тогда 
				МассивПрофилейГрупп  	= ПолучитьМассивПрофилейГрупп(Стр.ИБ, ВыбранныеЗначения);   
				Стр.Профили.ЗагрузитьЗначения( МассивПрофилейГрупп);
			Иначе 
				Стр.Профили.ЗагрузитьЗначения( ВыбранныеЗначения);
			КонецЕсли;
			
		КонецЦикла;

	ИначеЕсли ЗначениеЗаполнено(ДополнительныеПараметры) И ДополнительныеПараметры.Свойство("ИБ") Тогда    	
		
		НайденнаяСтрока = Получатели.НайтиСтроки(Новый Структура("ИБ", ДополнительныеПараметры.ИБ)); 
		ТекСтрокаПрофили = НайденнаяСтрока[0].Профили;
		
		ВыбранныеЗначения = Результат.Получить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденнаяСтрока[0].ИБ, "Конфигурация"));
		Если Не ВыбранныеЗначения = Неопределено Тогда    
			ТекСтрокаПрофили.Очистить();
			Для каждого Стр Из ВыбранныеЗначения Цикл
				ТекСтрокаПрофили.Добавить(Стр,,Истина);	
			КонецЦикла;   
		КонецЕсли;
		
		НайденнаяСтрока[0].Регистрировать = Истина;
		
	Иначе
		
		Для Каждого Стр Из Получатели Цикл
			
			Если Не Стр.Регистрировать Тогда 
				Продолжить;		
			КонецЕсли;     
			
			ВыбранныеЗначения = Результат.Получить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ИБ, "Конфигурация"));
			Если Не ВыбранныеЗначения = Неопределено Тогда 
				Стр.Профили.Очистить();
				//Для каждого Значение Из ВыбранныеЗначения Цикл 
					Если РежимГрупп = "Группы" Тогда 
						МассивПрофилейГрупп  	= ПолучитьМассивПрофилейГрупп(Стр.ИБ, ВыбранныеЗначения);   
						Стр.Профили.ЗагрузитьЗначения( МассивПрофилейГрупп);
					Иначе 
						Стр.Профили.ЗагрузитьЗначения( ВыбранныеЗначения);
					КонецЕсли;
					
					//Стр.Профили.Добавить(Значение,,Истина);	
				//КонецЦикла;				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьНаСервере()
	
	Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", НастройкиАвторизации.ИмяПользователя, НастройкиАвторизации.Пароль));	
	
	Для Каждого Получатель Из Получатели Цикл
		
		Если Не Получатель.Регистрировать Тогда
			Продолжить;
		КонецЕсли;    
		
		РеквизитыИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Получатель.ИБ, "ПутьНаВебСервере, Конфигурация");
		Если Режим = 0 Тогда
			ЗарегистрироватьПользователяВБазеПолучателе(ЭтотОбъект, Получатель, РеквизитыИБ, Аутентификация);
		ИначеЕсли Режим = 1 Тогда
			Для Каждого Пользователь Из СписокПользователей Цикл 
				ЗарегистрироватьПользователяВБазеПолучателе(Пользователь, Получатель, РеквизитыИБ, Аутентификация);
			КонецЦикла;	
		КонецЕсли;
		             	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьПользователяВБазеПолучателе(ОбъектРегистрации, ТекСтрокаПолучатель, РеквизитыБазыПолучателя, Аутентификация) 
	
	ТекстПодзапроса = ПодзапросПоискаПользователяПоНаименованию(ОбъектРегистрации);
		
	ГУИДПользователя = "";
	Попытка
		Ответ = Интеграция.ОбратитьсяКВебСервису(РеквизитыБазыПолучателя.ПутьНаВебСервере, "GET", "Catalogs/Users" + ТекстПодзапроса, Аутентификация);   
		Если ТипЗнч(Ответ) = Тип("Массив") И Ответ.Количество() > 0 Тогда
			ГУИДПользователя = Ответ[0].Ссылка;
		КонецЕсли;
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось обратиться к веб-сервису. Подробности см. в Журнале Регистрации.");		
	КонецПопытки;
	
	РеквизитыОбъекта = Новый Структура();          
	РеквизитыОбъекта.Вставить("Ссылка", ГУИДПользователя);
	РеквизитыОбъекта.Вставить("Наименование", ОбъектРегистрации.Логин); 
	РеквизитыОбъекта.Вставить("Недействителен", ОбъектРегистрации.ВходВПрограммуЗапрещен);  
	
	ОписаниеПользователяИБ = Новый Структура; 
	Если Не ЗначениеЗаполнено(ГУИДПользователя) Тогда
		
		ОписаниеПользователяИБ.Вставить("ПолноеИмя", ОбъектРегистрации.Логин);
		ОписаниеПользователяИБ.Вставить("Имя", ОбъектРегистрации.Логин);
		ОписаниеПользователяИБ.Вставить("Пароль", ОбъектРегистрации.Пароль);                           
		ОписаниеПользователяИБ.Вставить("АдресЭлектроннойПочты", ОбъектРегистрации.Почта);
		ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", Не ОбъектРегистрации.ВходВПрограммуЗапрещен);
		ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", ОбъектРегистрации.Аутентификация1С);
		ОписаниеПользователяИБ.Вставить("АутентификацияОС", ОбъектРегистрации.АутентификацияОС);
		ОписаниеПользователяИБ.Вставить("ПользовательОС", ОбъектРегистрации.ПользовательОС);
		ОписаниеПользователяИБ.Вставить("ПоказыватьВСпискеВыбора", ОбъектРегистрации.ПоказыватьВСпискеВыбора);
		ОписаниеПользователяИБ.Вставить("ПотребоватьСменуПароляПриВходе", ОбъектРегистрации.ПотребоватьСменуПароляПриВходе);			
		ОписаниеПользователяИБ.Вставить("Язык", ?(ЗначениеЗаполнено(ОбъектРегистрации.Язык), ОбъектРегистрации.Язык, "Английский"));    
		
		ОписаниеПользователяИБ.Вставить("Действие", "Записать"); 
		ОписаниеПользователяИБ.Вставить("ПарольУстановлен", ЗначениеЗаполнено(ОбъектРегистрации.Пароль)); 
			
		Если РеквизитыБазыПолучателя.Конфигурация = Перечисления.КонфигурацииИнформационныхБаз.УправлениеХолдингом Тогда
			ОписаниеПользователяИБ.Вставить("ОсновнойЯзыкУХ", "English");
		КонецЕсли; 
		
		РеквизитыОбъекта.Вставить("ДополнительныеСвойства", Новый Структура("ОписаниеПользователяИБ", ОписаниеПользователяИБ));
		
	КонецЕсли;	
	
	ДанныеДляДопОбработчиков = Новый Структура;
	ДанныеДляДопОбработчиков.Вставить("ПередЗаписью", Новый Структура("АдресЭлектроннойПочты", ОбъектРегистрации.Почта));
	ДанныеДляДопОбработчиков.Вставить("ПриЗаписи", Новый Структура("Профили", ТекСтрокаПолучатель.Профили.ВыгрузитьЗначения()));    		
	РеквизитыОбъекта.Вставить("ДопОбработчики", ДанныеДляДопОбработчиков);
	
	Если ЗначениеЗаполнено(ГУИДПользователя) Тогда
		ДанныеДляДопОбработчиков.ПередЗаписью.Удалить("АдресЭлектроннойПочты");	
	КонецЕсли;
	
	ПутьНаВебСервере = РеквизитыБазыПолучателя.ПутьНаВебСервере; 
	Попытка 
		Если Не ЗначениеЗаполнено(ГУИДПользователя) Тогда
			Ответ = Интеграция.ОбратитьсяКВебСервису(ПутьНаВебСервере, "POST", "Catalogs/Users", Аутентификация, РеквизитыОбъекта);  
		Иначе
			Ответ = Интеграция.ОбратитьсяКВебСервису(ПутьНаВебСервере, "PUT", "Catalogs/Users", Аутентификация, РеквизитыОбъекта);  
		КонецЕсли;
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Ошибка при регистрации объекта " + ПутьНаВебСервере + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
	КонецПопытки; 
	
	Если ТипЗнч(Ответ) = Тип("Структура") И Ответ.Свойство("error") И Ответ.error Тогда    
		ТекстОшибки = "Ошибка при регистрации объекта " + ПутьНаВебСервере + Символы.ПС + Ответ.message;
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ТекСтрокаПолучатель.Результат = ТекстОшибки;
	ИначеЕсли ТипЗнч(Ответ) = Тип("Структура") И Ответ.Свойство("object_id") И СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Ответ.object_id) Тогда 
		ТекСтрокаПолучатель.Результат = "Ок"; 
		//ins+
		Ответ = Справочники.ПользователиИБ.СоздатьПользователей(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектРегистрации.Логин),Истина);
		ПользовательИБ = Ответ.Результат.Получить(ОбъектРегистрации.Логин);
		Если ЗначениеЗаполнено(ПользовательИБ) Тогда 
			Структура = РегистрыСведений.ПрофилиПользователей.ПолучитьСтруктуруЗаписи();
			Структура.ПользовательИБ = ПользовательИБ;
			Структура.Иб = ТекСтрокаПолучатель.ИБ;
			РегистрыСведений.ПрофилиПользователей.ЗаписатьМассивПрофилей(Структура,ТекСтрокаПолучатель.Профили.ВыгрузитьЗначения());
		КонецЕсли;
		//ins-
	Иначе
		ТекСтрокаПолучатель.Результат = "Непредвиденная ошибка при регистрации пользователя! " + ОбъектРегистрации.Логин;
	КонецЕсли;				
		
КонецПроцедуры 

&НаСервере
Функция ПодзапросПоискаПользователяПоНаименованию(ОбъектРегистрации)
	
	Возврат
	
	"?Subrequest=" + 
	"ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.Пользователи
	|ГДЕ
	|	Наименование = """ + ОбъектРегистрации.Логин + """";
	
КонецФункции

&НаСервере
Процедура ВыполнитьГрупповойОбработчик()
	
	ПараметрыОбработчика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГрупповойОбработчик, "Владелец, ПредставлениеВСервисе");
	ПараметрыРегистрацииОбработчика = Интеграция.ПараметрыРегистрацииИзБазы(ПараметрыОбработчика.Владелец, ПараметрыОбработчика.ПредставлениеВСервисе);
	
	Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", НастройкиАвторизации.ИмяПользователя, НастройкиАвторизации.Пароль));
	
	Для Каждого Получатель Из Получатели Цикл 
		
		ПутьКБазеНаВебСервере = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Получатель.ИБ, "ПутьНаВебСервере");			
		Интеграция.ЗарегистрироватьОбъектМетаданных(ПутьКБазеНаВебСервере, Аутентификация, ПараметрыРегистрацииОбработчика); 		
			
		СтрокаПодключения = ПутьКБазеНаВебСервере + "/hs/um/" + ПараметрыРегистрацииОбработчика.parent + "/" + ПараметрыРегистрацииОбработчика.name;
	
		Ответ = КоннекторHTTP.GetJson(СтрокаПодключения,, Аутентификация);
		Если Ответ.Свойство("error") И Ответ.error Тогда    
			ТекстОшибки = "Ошибка при групповой обработке " + ПутьКБазеНаВебСервере + Символы.ПС + Ответ.message;
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Получатель.Результат = ТекстОшибки;
		Иначе
			Получатель.Результат = "ОК";
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблонуЗавершение(СимволРазделения, ДополнительныеПараметры) Экспорт
	
	Шаблон = ДополнительныеПараметры.Шаблон;
	
	СтрЗамены = СокрЛП(Логин);
	
	Если ЗначениеЗаполнено(СимволРазделения) Тогда 
		СтрЗамены = СтрЗаменить(СтрЗамены, " ", СимволРазделения);
	КонецЕсли;
	
	ПользовательОС = СтрШаблон(Шаблон, СтрЗамены);

КонецПроцедуры
  
&НаКлиенте   
Процедура ЛогинПриИзмененииЭлемента(РеквизитЛогин, РеквизитПользовательОС)
	
	Если Элементы.ФормаПомощник.Пометка И ЗначениеЗаполнено(РеквизитЛогин) Тогда
		
		ИсходныеДанные = СокрЛП(РеквизитЛогин);
		
		Если СтрНайти(ИсходныеДанные, " ") = 0 Тогда 
			РеквизитЛогин = СтрЗаменить(ИсходныеДанные, ".", " ");
			ТестПользователь = ИсходныеДанные;
		Иначе                                          
			РеквизитЛогин = ИсходныеДанные;
			ТестПользователь = СтрЗаменить(ИсходныеДанные, " ", "."); 
		КонецЕсли;
		
		ЗаполнитьПользователя = Истина;
		Если ЗначениеЗаполнено(РеквизитПользовательОС) И СтрНайти(РеквизитПользовательОС, ТестПользователь) Тогда 
			ЗаполнитьПользователя = Ложь;
		КонецЕсли;
		
		Если ЗаполнитьПользователя Тогда 
			Шаблон = ОбщегоНазначенияВызовСервера.ЗначениеДополнительнойКонстанты("ШаблонЗаполненияПользователя");
			
			Если Не ЗначениеЗаполнено(Шаблон) Тогда 
				ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено значение шаблона 'ШаблонЗаполненияПользователя'");
				Возврат;
			КонецЕсли;   
			РеквизитПользовательОС = СтрШаблон(Шаблон, ТестПользователь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеРеквизитов(ОбъектПроверки, Отказ, ТекСтрока = Неопределено)
	
	Если ОбъектПроверки.Аутентификация1С И ПустаяСтрока(ОбъектПроверки.Пароль) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указан пароль!'"),,?(Режим = 1, "СписокПользователей[" + ТекСтрока +"].Пароль", "Пароль"),,Отказ);	
	КонецЕсли;
	
	Если ОбъектПроверки.АутентификацияОС И ПустаяСтрока(ОбъектПроверки.ПользовательОС) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указан пользователь ОС!'"),,?(Режим = 1, "СписокПользователей[" + ТекСтрока +"].ПользовательОС", "ПользовательОС"),,Отказ);	
	КонецЕсли;   
	
	Если Не ОбъектПроверки.ВходВПрограммуЗапрещен И Не ОбъектПроверки.Аутентификация1С И Не ОбъектПроверки.АутентификацияОС Тогда  
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Выберите способ аутентификации (1С или ОС)!'"),,?(Режим = 1, "СписокПользователей[" + ТекСтрока +"].Аутентификация1С", "Аутентификация1С"),,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СгенерироватьПарольНаСервере()
	Возврат Пользователи.СоздатьПароль(12);	
КонецФункции

&НаСервереБезКонтекста
Процедура СформироватьПояснениеКОбработчику(Обработчик, Пояснение)
	
	Пояснение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Обработчик, "Комментарий")	
	
КонецПроцедуры


&НаКлиенте
Процедура Инверсия(Команда)
	Для Каждого Эл Из Получатели Цикл 
		Эл.Регистрировать = Не Эл.Регистрировать и ЗначениеЗаполнено(Эл.ПутьНаВебСервере);
	КонецЦикла;
	ОбновитьШапкуБаза();
КонецПроцедуры

&НаКлиенте
Процедура УбратьБезГалок(Команда)  
	МассивКУдалению = Новый Массив;  
	Отбор = Новый Структура("Регистрировать", Ложь);
	Найдено = Получатели.НайтиСтроки(Отбор);
	Для Каждого Эл Из Найдено Цикл 
		Получатели.Удалить(Эл);
	КонецЦикла;  
	ОбновитьШапкуБаза();
КонецПроцедуры


&НаКлиенте
Процедура ПолучателиРегистрироватьПриИзменении(Элемент) 
	ПодключитьОбработчикОжидания("ОжиданиеОбновления", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОжиданиеОбновления() Экспорт 
	ОтключитьОбработчикОжидания("ОжиданиеОбновления");
	ОбновитьШапкуБаза();
КонецПроцедуры


&НаКлиенте
Процедура ПолучателиПослеУдаления(Элемент)
	ОбновитьШапкуБаза();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьПрофили(Команда)
	Строка = "";
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавитьПрофилиЗавершение", ЭтотОбъект, Новый Структура("Добавлять", Истина)), Строка, "Укажите роли (добавить)",,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПрофилиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Добавлять = Ложь;
	Если ДополнительныеПараметры.Свойство("Добавлять") И ДополнительныеПараметры.Добавлять Тогда 
		Добавлять = Истина;
	КонецЕсли;
	
	Если (Результат <> Неопределено) Тогда 
		ЗаполнитьПрофилиПоСтроке(Результат,Добавлять);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПрофилиПоСтроке(Строка, Добавлять = Ложь)
	
	Массив = СтрРазделить(Строка, ",", Ложь);
	Для Каждого Эл из Массив Цикл 
		Эл = СокрЛП(Эл);
	КонецЦикла;
	
	Для Каждого Стр Из Получатели Цикл
		
		Если Не Стр.Регистрировать Тогда 
			Продолжить;		
		КонецЕсли;     
		
		//ВыбранныеЗначения = Результат.Получить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ИБ, "Конфигурация"));
		//Если Не ВыбранныеЗначения = Неопределено Тогда 
		Если Добавлять = Ложь Тогда 
			Стр.Профили.Очистить();
			МассивДобавить = Массив;
		Иначе 
			СтарыйМассив 	= ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(Стр.Профили);
			МассивДобавить 	= ОбщегоНазначенияКлиентСервер.РазностьМассивов(Массив,СтарыйМассив);
		КонецЕсли;
		
		Для каждого Значение Из МассивДобавить Цикл
			Стр.Профили.Добавить(Значение,,Истина);	
		КонецЦикла;				
		
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура УстановитьПрофили(Команда)
	Строка = "";
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавитьПрофилиЗавершение", ЭтотОбъект, Новый Структура("Добавлять", Ложь)), Строка, "Укажите роли",,Истина);
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыделение(Команда)
	Для Каждого Эл Из Получатели Цикл 
		Эл.Регистрировать = Ложь;
	КонецЦикла;
	ОбновитьШапкуБаза();

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьГруппы(Команда)
	ОткрытьФормуЗаполненияГруппДоступа();
КонецПроцедуры                                   

&НаКлиенте
Процедура ОткрытьФормуЗаполненияГруппДоступа(ИнформационныеБазы = Неопределено, ТекущиеГруппы = Неопределено, ДополнительныеПараметры = Неопределено)
	
	
	Если ИнформационныеБазы = Неопределено Тогда
		
		ИнформационныеБазы = Новый Массив;  	
		Для Каждого Стр Из Получатели Цикл  	
			
			ИнформационныеБазы.Добавить(Стр.ИБ);
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ИнформационныеБазы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны информационные базы для заполнения.'"));
		Возврат;
	КонецЕсли;  
	Если ДополнительныеПараметры = Неопределено Тогда 
		ДополнительныеПараметры  = Новый Структура;
	КонецЕсли;
	ДополнительныеПараметры.Вставить("Режим", "Группы");
	ОбработкаОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыЗаполненияПрофилейГруппДоступа", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.ГруппыПрофилей.Форма.ФормаПодбораГруппДоступа", 
					Новый Структура("ИнформационныеБазы, ТекущиеГруппы", ИнформационныеБазы, ТекущиеГруппы),
						ЭтотОбъект,УникальныйИдентификатор,,,ОбработкаОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
						
КонецПроцедуры

#КонецОбласти
